## list ##
aa = [10, 20, 30, 40, 50]
aa[1:4] = []
print(aa)


#----------------------------------------------------------
# []
aa = [10, 20, 30]
aa = []
print(aa)

# None으로 나옴(아무것도 안나옴)
aa = [10, 20, 30]
aa = None
print(aa)

# 오류발생
a = [10, 20, 30]
del(aa)
print(aa)



#----------------------------------------------------------
## 리스트 값에 접근하는 다양한 방법 ##
# 음수값으로 접근
aa = [10, 20, 30, 40]
print("aa[-1]은 %d, aa[-2]는 %d" % (aa[-1], aa[-2]))

# 리스트에 접근할 때 콜론(:)을 사용해 범위를 지정
aa = [10, 20, 30, 40]
print(aa[0:3])
print(aa[2:4])


#----------------------------------------------------------
aa = [10, 20, 30]
aa[1] = 200
print(aa)

aa = [10, 20, 30]
aa[1:2] = [200, 201]
print(aa)